app/controllers/main_controller.rb

SELECT * FROM "blog_posts" WHERE (status = 'published') ORDER BY blog_posts.created_at DESC
SELECT * FROM "posts" WHERE (status = 'published') ORDER BY posts.created_at DESC
SELECT * FROM "blog_posts"
---
  def set_archive_list
    posts = Post.find(:all, :conditions => ["status = 'published'"], :order => "created_at DESC")
		@archive_list = posts.collect do |p|